<?php

namespace App\Mock\Profile;

use App\Mock\AMock;

class UpdateBusinessDataMockData extends AMock
{
    public const RESPONSE200 = [
        [
            'message' => 'success',
        ]
    ];

    public const ERRORS = [
        [
            'type' => [
                'این قسمت نباید خالی باشد',
                'نوع فروشنده برای این کار مجاز نیست',
            ],
            'first_name' => [
                'مقدار وارد شده باید فقط شامل حروف باشد',
            ],
            'last_name' => [
                'مقدار وارد شده باید فقط شامل حروف باشد',
            ],
            'national_id' => [
                'کد ملی نادرست است',
                'فروشنده با این کد ملی قبلا تایید شده است',
            ],
            'company_name' => [
                'مقدار واردشده کوتاه‌تر از حد مجاز است',
                'مقدار واردشده بلندتر از حد مجاز است',
                'نام شرکت تکراری است',
                'فروشنده با این کد ملی قبلا تایید شده است',
            ],
            'company_type' => [
                'مقدار وارد شده باید فقط شامل حروف باشد',
            ],
            'company_registration_number' => [
                'مقدار وارد شده باید عددی باشد',
                'مقدار واردشده کوتاه‌تر از حد مجاز است',
                'مقدار واردشده بلندتر از حد مجاز است',
                'فروشنده با این کد ملی قبلا تایید شده است',
            ],
            'company_national_id_number' => [
                'مقدار وارد شده باید عددی باشد',
                'مقدار وارد شده برابر حد مجاز نیست',
                'کد ملی نادرست است',
                'فروشنده با این کد ملی قبلا تایید شده است',
                'شناسه ملی شرکت تکراری است',
            ],
            'company_economic_number' => [
                'مقدار وارد شده برابر حد مجاز نیست',

            ],
            'company_authorized_representative' => [
                'مقدار واردشده کوتاه‌تر از حد مجاز است',
                'مقدار واردشده بلندتر از حد مجاز است',
                'نوع فروشنده برای این کار مجاز نیست',
            ],
        ]
    ];
}