<?php

namespace App\Mock\QuestionAndAnswer;

use App\Mock\AMock;

class SaveAnswerMockData extends AMock
{
    public const RESPONSE200 = [
        [
            "id" => 4346814,
            "body" =>
                "درود بر شما بله این کالا از برند پاپا و با سایز استاندارد تقدیم شما میشود(*فروشگاه آنلاین اُرسیران*)",
            "files" => [],
            "status" => ["title" => "در حال بررسی", "key" => "pending"],
            "date" => "2024-07-06",
        ],
        [
            "id" => 4346658,
            "body" =>
                "بستگی به طراحی مکانیکیتون دارد و یا استفاده از گیربکس متناسب کاریتون میتونه به کارتون بیاد.",
            "files" => [],
            "status" => ["title" => "در حال بررسی", "key" => "pending"],
            "date" => "2024-07-06",
        ],
        [
            "id" => 4346629,
            "body" =>
                "با درود و سپاس از انتخاب شما . ارتفاع محصول 32 سانتی متر است",
            "files" => [],
            "status" => ["title" => "در حال بررسی", "key" => "pending"],
            "date" => "2024-07-06",
        ],
    ];

    public const ERRORS = [
        [
            'question_id' => [
                'این قسمت نباید خالی باشد',
                'مقدار وارد شده باید عددی باشد',
                'شماره سوال اشتباه است',
                'وضعیت سوال اشتباه است',
                'شما اجازه پاسخ به این سوال را ندارید',
            ],
            'answer' => [
                'این قسمت نباید خالی باشد',
                'طول پاسح اشتباه است',
            ],
            'file_ids' => [
                'مقدار وارد شده معتبر نمیباشد',
                'شماره فایل اشتباه است',
            ],
        ],
    ];
}